In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
    'key2' : ['one', 'two', 'one', 'two', 'one'],
    'data1' : np.random.randn(5),
    'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.464801 -0.063134
1    a  two  0.751744  0.562105
2    b  one  1.161893  0.588739
3    b  two -0.508363 -2.568432
4    a  one -0.504754 -0.269968

In [4]:
grouped = df['data1'].groupby(df['key1'])

In [5]:
grouped

In [6]:
grouped.mean()

key1
a   -0.072604
b    0.326765
Name: data1, dtype: float64

In [7]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one    -0.484778
      two     0.751744
b     one     1.161893
      two    -0.508363
Name: data1, dtype: float64

In [8]:
means.unstack()

key2       one       two
key1
a    -0.484778  0.751744
b     1.161893 -0.508363

In [9]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [10]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [11]:
df['data1'].groupby([states, years]).mean()

California  2005    0.751744
            2006    1.161893
Ohio        2005   -0.486582
            2006   -0.504754
Name: data1, dtype: float64

In [12]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.072604  0.076335
b     0.326765 -0.989847

In [13]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.484778 -0.166551
     two   0.751744  0.562105
b    one   1.161893  0.588739
     two  -0.508363 -2.568432

In [14]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [15]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.464801 -0.063134
1    a  two  0.751744  0.562105
4    a  one -0.504754 -0.269968
b
  key1 key2     data1     data2
2    b  one  1.161893  0.588739
3    b  two -0.508363 -2.568432

In [16]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -0.464801 -0.063134
4    a  one -0.504754 -0.269968
('a', 'two')
  key1 key2     data1     data2
1    a  two  0.751744  0.562105
('b', 'one')
  key1 key2     data1     data2
2    b  one  1.161893  0.588739
('b', 'two')
  key1 key2     data1     data2
3    b  two -0.508363 -2.568432

In [17]:
pieces = dict(list(df.groupby('key1')))
pieces['b']

  key1 key2     data1     data2
2    b  one  1.161893  0.588739
3    b  two -0.508363 -2.568432

In [18]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [19]:
grouped = df.groupby(df.dtypes, axis=1)

In [20]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.464801 -0.063134
1  0.751744  0.562105
2  1.161893  0.588739
3 -0.508363 -2.568432
4 -0.504754 -0.269968
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [21]:
df.groupby('key1')['data1']
df.groupby('key1')[['data2']]

In [22]:
df['data1'].groupby(df['key1'])
df[['data2']].groupby(df['key1'])

In [23]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.166551
     two   0.562105
b    one   0.588739
     two  -2.568432

In [24]:
s_grouped = df.groupby(['key1', 'key2'])['data2']
s_grouped

In [25]:
s_grouped.mean()

key1  key2
a     one    -0.166551
      two     0.562105
b     one     0.588739
      two    -2.568432
Name: data2, dtype: float64

In [26]:
people = pd.DataFrame(np.random.randn(5, 5),
    columns=['a', 'b', 'c', 'd', 'e'],
    index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [27]:
people.iloc[2:3, [1, 2]] = np.nan
people

               a         b         c         d         e
Joe     1.136463 -0.287265  1.163613  1.502973  0.010451
Steve  -0.258292  0.505682  0.492422 -1.359759 -0.016981
Wes     0.386635       NaN       NaN -0.198141 -1.985338
Jim    -0.150452 -1.175461 -1.566071 -0.093305  1.844383
Travis -0.143912 -0.407228 -0.098081  1.007754  1.336854

In [28]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
    'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [29]:
by_column = people.groupby(mapping, axis=1)

In [30]:
by_column.sum()

            blue       red
Joe     2.666586  0.859649
Steve  -0.867338  0.230409
Wes    -0.198141 -1.598703
Jim    -1.659376  0.518470
Travis  0.909673  0.785714

In [31]:
map_series = pd.Series(mapping)

In [32]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [33]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [34]:
people.groupby(len).sum()

          a         b         c         d         e
3  1.372646 -1.462726 -0.402459  1.211527 -0.130504
5 -0.258292  0.505682  0.492422 -1.359759 -0.016981
6 -0.143912 -0.407228 -0.098081  1.007754  1.336854

In [35]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [36]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one  0.386635 -0.287265  1.163613 -0.198141 -1.985338
  two -0.150452 -1.175461 -1.566071 -0.093305  1.844383
5 one -0.258292  0.505682  0.492422 -1.359759 -0.016981
6 two -0.143912 -0.407228 -0.098081  1.007754  1.336854

In [37]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
    [1, 3, 5, 1, 3]],
    names=['cty', 'tenor'])

In [38]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [39]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.605548  0.939526  0.681294  0.031755  0.029178
1      1.066966  0.393478 -1.583225  0.096512  0.727944
2     -0.090144 -1.342103 -1.206744  0.680612  0.764333
3     -0.118196  0.183201 -0.096033 -0.121274  1.137875

In [40]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [41]:
grouped = df.groupby('key1')

In [42]:
grouped['data1'].quantile(0.9)

key1
a    0.508435
b    0.994868
Name: data1, dtype: float64

In [43]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [44]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.256498  0.832073
b     1.670257  3.157170

In [45]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.072604  0.714185 -0.504754 -0.484778 -0.464801  0.143472
b      2.0  0.326765  1.181050 -0.508363 -0.090799  0.326765  0.744329

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.751744   3.0  0.076335  0.433215 -0.269968 -0.166551 -0.063134
b     1.161893   2.0 -0.989847  2.232457 -2.568432 -1.779139 -0.989847


           75%       max
key1
a     0.249486  0.562105
b    -0.200554  0.588739

In [46]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [47]:
f = lambda x: x.describe()
grouped.apply(f)

               data1     data2
key1
a    count  3.000000  3.000000
     mean  -0.072604  0.076335
     std    0.714185  0.433215
     min   -0.504754 -0.269968
     25%   -0.484778 -0.166551
     50%   -0.464801 -0.063134
     75%    0.143472  0.249486
     max    0.751744  0.562105
b    count  2.000000  2.000000
     mean   0.326765 -0.989847
     std    1.181050  2.232457
     min   -0.508363 -2.568432
     25%   -0.090799 -1.779139
     50%    0.326765 -0.989847
     75%    0.744329 -0.200554
     max    1.161893  0.588739

In [49]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
                      'data2': np.random.randn(1000)})

In [50]:
quartiles = pd.cut(frame.data1, 4)

In [51]:
quartiles[:10]

0     (0.0683, 1.712]
1    (-1.575, 0.0683]
2    (-1.575, 0.0683]
3     (0.0683, 1.712]
4     (0.0683, 1.712]
5    (-1.575, 0.0683]
6     (0.0683, 1.712]
7    (-1.575, 0.0683]
8    (-1.575, 0.0683]
9    (-1.575, 0.0683]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.225, -1.575] < (-1.575, 0.0683] < (0.0683, 1.712] < (1.712, 3.355]]

In [52]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
    'count': group.count(), 'mean': group.mean()}

In [53]:
grouped = frame.data2.groupby(quartiles)

In [54]:
grouped.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-3.225, -1.575]   54.0  2.135816  0.024658 -2.251712
(-1.575, 0.0683]  506.0  2.658901  0.024582 -3.192457
(0.0683, 1.712]   405.0  2.823383  0.023494 -3.279621
(1.712, 3.355]     35.0  2.027872  0.359085 -1.566151

In [55]:
grouping = pd.qcut(frame.data1, 10, labels=False)

In [56]:
grouped = frame.data2.groupby(grouping)

In [57]:
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  2.135816  0.059531 -2.251712
1      100.0  2.350112 -0.007258 -3.192457
2      100.0  2.522653 -0.211606 -2.643422
3      100.0  2.386208  0.036734 -2.934853
4      100.0  2.549435  0.195811 -1.994871
5      100.0  2.658901  0.029922 -3.279621
6      100.0  2.823383 -0.043807 -2.789694
7      100.0  2.597673  0.084571 -2.448657
8      100.0  2.404284  0.074216 -1.941048
9      100.0  2.344292  0.140418 -2.362992

In [58]:
s = pd.Series(np.random.randn(6))

In [59]:
s[::2] = np.nan

In [60]:
s

0         NaN
1    0.705012
2         NaN
3   -0.927935
4         NaN
5   -1.422650
dtype: float64

In [61]:
s.fillna(s.mean())

0   -0.548524
1    0.705012
2   -0.548524
3   -0.927935
4   -0.548524
5   -1.422650
dtype: float64

In [62]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
    'Oregon', 'Nevada', 'California', 'Idaho']

In [63]:
group_key = ['East'] * 4 + ['West'] * 4

In [64]:
data = pd.Series(np.random.randn(8), index=states)

In [65]:
data

Ohio         -0.361268
New York     -0.150665
Vermont      -0.909862
Florida      -1.332210
Oregon       -0.825255
Nevada        0.183426
California    2.088989
Idaho         0.617955
dtype: float64

In [66]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan

In [67]:
data

Ohio         -0.361268
New York     -0.150665
Vermont            NaN
Florida      -1.332210
Oregon       -0.825255
Nevada             NaN
California    2.088989
Idaho              NaN
dtype: float64

In [68]:
data.groupby(group_key).mean()

East   -0.614714
West    0.631867
dtype: float64

In [70]:
fill_values = {'East': 0.5, 'West': -1}

In [71]:
fill_func = lambda g: g.fillna(fill_values[g.name])

In [72]:
data.groupby(group_key).apply(fill_func)

Ohio         -0.361268
New York     -0.150665
Vermont       0.500000
Florida      -1.332210
Oregon       -0.825255
Nevada       -1.000000
California    2.088989
Idaho        -1.000000
dtype: float64

In [74]:
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']
cards = []
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num) + suit for num in base_names)
deck = pd.Series(card_val, index=cards)

In [75]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [76]:
def draw(deck, n=5):
    return deck.sample(n)

In [77]:
draw(deck)

5D     5
2D     2
AS     1
QH    10
5C     5
dtype: int64

In [78]:
get_suit = lambda card: card[-1]

In [79]:
deck.groupby(get_suit).apply(draw, n=2)

C  3C      3
   AC      1
D  4D      4
   6D      6
H  2H      2
   KH     10
S  6S      6
   10S    10
dtype: int64

In [80]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

QC    10
2C     2
7D     7
6D     6
4H     4
7H     7
KS    10
AS     1
dtype: int64

In [81]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a',
    'b', 'b', 'b', 'b'],
    'data': np.random.randn(8),
    'weights': np.random.rand(8)})

In [82]:
df

  category      data   weights
0        a  1.235859  0.464126
1        a -1.610983  0.896773
2        a  0.247311  0.830706
3        a  0.244541  0.147830
4        b  1.389051  0.924662
5        b  0.025918  0.129335
6        b -0.012326  0.659242
7        b -1.397929  0.524721

In [83]:
grouped = df.groupby('category')

In [84]:
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])

In [85]:
grouped.apply(get_wavg)

category
a   -0.269081
b    0.244020
dtype: float64

In [86]:
import statsmodels.api as sm
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1.
    result = sm.OLS(Y, X).fit()
    return result.params